Tekla Open API Reference for Tekla Structures 2025
ContourPoint.Chamfer Property
 The chamfer for the contour point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Chamfer Chamfer { get; set; }
Public Property Chamfer As Chamfer
	Get
	Set
Property Value
Type: Chamfer
See Also
Reference
ContourPoint Class
Tekla.Structures.Model Namespace